JoseTrinidadLM/GRID_FORMING_STM32F446RE_PA/GRID_FORMING/Src/main.c
/**
 ******************************************************************************
 * @file           : main.c
 * @author         : Auto-generated by STM32CubeIDE
 * @brief          : Main program body
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2025 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */

/*
 *  PA0 -> ADC1 -> DMA -> raw_sensor_value[0] -> characterized sensor outputs
 *			^
 *			|
 * 			TIM2
 *
 *	ClosedLoop/OpenLoop Operation Mode -> dutyCycle -> PWM
 *
 *
 */

/*
 * USART 2->STLINK
 *
 * TX->PA2
 * RX->PA3
 *
 */

#include <string.h>
#include "stm32f446xx.h"

float packets_value[5]; 	//Data packet to be sent via UART

uint8_t heartbeat[2];

GPIO_Handle_t LED;

void LED_GPIOInits(void)
{
	LED.pGPIOx = GPIOA;
	LED.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_OUT;
	//LED.GPIO_PinConfig.GPIO_PinAltFunMode = 2;
	LED.GPIO_PinConfig.GPIO_PinOPType = GPIO_OP_TYPE_PP;
	LED.GPIO_PinConfig.GPIO_PinSpeed = GPIO_SPEED_FAST;
	LED.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_NO_PUPD;
	//LED D13
	LED.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_5;
	GPIO_Init(&LED);
}

int main(void)
{
	SystemCLK_Config_84MHz();

	SCB_CPACR |= ((3UL << 10*2) | (3UL << 11*2)); //FPU Enabled

	ControlInit();
	//Control_Start(); Note: Use after comand start or start btn

	ProtocolInit(USART2, GPIOA, GPIOA, GPIO_PIN_NO_2, GPIO_PIN_NO_3, packets_value, heartbeat);
	Protocol_TIMInit(TIM3);
	Protocol_Start();

	//Call Protocol_Telemetry_EN() to send values in @packets_value

	LED_GPIOInits();
	while(1)
	{
		Protocol_HeartBeat();
		Protocol_Telemetry();
	}
	return 0;
}

void TIM3_IRQHandler(void)
{
	Protocol_HeartBeat_EN();
	Protocol_TIMx_IRQHandling();
}

void DMA1_Stream6_IRQHandler(void)
{
	Protocol_DMAx_TX_IRQHandling();
}

void DMA1_Stream5_IRQHandler(void)
{
	Protocol_DMAx_RX_IRQHandling();
}

void TIM2_IRQHandler(void)
{
	TIM2_IRQHandling();

	if(Control_ReadSensors(packets_value) == FLAG_RESET) Protocol_Telemetry_EN();
	
	Control_DutyCycle();

}

void executeCommand(uint8_t command)
{
	//TO-DO: Depending on command change values in Power & Loop
	heartbeat[0] = Control_Mode(); //Introduce Power & Loop values
}

/*This interruption can be triggered by GPIOB 14-15*/
void EXTI15_10_IRQHandler(void)
{
	//TO-DO: Detect button pressed once (valid)
	//toggle values Power & Loop
	GPIO_IRQHandling(GPIO_PIN_NO_14);
	/*Both pins are read*/
	//SYSTEM_STATE = GPIO_ReadFromInputPin(GPIOB, GPIO_PIN_NO_14); // TO-DO: make a function to toggle between ENABLE/DISABLE
	//OPERATION_MODE = GPIO_ReadFromInputPin(GPIOB, GPIO_PIN_NO_15);				

	heartbeat[0] = Control_Mode(heartbeat[0] && 0b1, (heartbeat[0] >> 1) && 0b1); //Introduce Power & Loop values
}


uint64_t comm[3] = {RESET}; //lo anadi para revisar que compilara

